var setting=[
  {
    "name":"小说分类",
    "context":["一、按篇幅分类:1、微型小说：比短篇更短的小说完全符合瞬息万变的现代社会中忙碌的人们的阅读习惯。几乎每天都可以看到人们为这类的小说赋予一个新名词和新定义，例如极短篇、精短小说、超短篇小说、微信息小说、一分钟小说、一袋烟小说、袖珍小说、焦点小说、瞳孔小说、拇指小说、迷你小说等，族繁不及备载，连专门的文学研究者也很难如数家珍分叙其定义，一般人更容易混淆，故总论之。一般认为小小说的篇幅应在两千字以下。因为题材常是生活经验的片段，因此可以是有头无尾、有尾无头、甚至无头无尾。高潮放在结尾，高潮一出马上完结，营造余音绕梁的意境。由于比短篇更短，字句也需要更加精练，题材能见微知著者为佳。一个意外的结局虽然能吸引眼球，但文章短还是要有伏笔呼应，甚至比起给予读者意外、应该更重视能否带给读者感动。2、短篇小说：平均篇幅在万言左右的小说会被划归短篇小说。在它的特色中有所谓三一律——一人一地一时，也就是减少角色、缩小舞台、短化故事中流动的时间。另外，虽然它们时常惜墨如金，但一般认为短篇小说仍应符合小说的原始定义、也就是对细节有足够的刻划，绝非长篇故事的节略或纲要。3、中篇小说：平均字数三至四万字的小说，一般认为是较容易成功的小说。因为对初涉创作领域的人而言，写作长篇易陷入多数的情节造成凌乱难收的困境，而写作短篇不是转折太少而单调、就是转折太多却显得拥挤。这时考虑将原本的构想改成中篇是一个广受推荐的建议。4、长篇小说：字数在六万字以上会被划归长篇小说。如果作者打算表现人生中常见的错综复杂关系，则必须使用这么大的篇幅。通常就算是笔调轻松的长篇小说，也会有一个内里的严肃主题，否则很容易陷入无组织或是零乱。初涉者在写作长篇时最需注意全局对主题的呼应、结构的严密性、以及避免重复矛盾或缺漏。","二、按题材分类：武侠小说、推理小说、历史小说、言情小说、科幻小说、奇幻小说、玄幻小说、探险小说、恐怖小说、冶艳小说、讽刺小说、神怪小说、电影小说、架空历史小说、网游小说、轻小说、军事小说、色情小说 ","三、按载体分类：手机小说、网络小说"," 四、按写作手法分类：第一人称、第二人称、第三人称、书信体小说、日记体小说、意识流小说"," 五、按流派分类：古典主义小说、现实主义小说、浪漫主义小说、形式主义小说、表现主义小说、存在主义小说、意识流小说、黑色幽默、新小说派、魔幻现实主义 ","六、按年代分类：古代小说、现代小说、后现代小说 ","七、按进程分类：连载小说、全本小说"],
    "url":"https://6275-buhuolinggan-9gyslra9e051f6a6-1304749657.tcb.qcloud.la/setting/6942958_144309296143_2.jpg?sign=12c9e524b98470834affb494469cc634&t=1611656232"
  },
  {
    "name":"古代年龄的别称",
    "context":["总角:指童年------语出《诗经》，如《诗·卫风·氓》“总角之宴”，陶渊明《荣木》序:“总角闻 道，白首无成。”","垂髫:指童年------古时童子未冠，头发下垂，因而以“垂髫”代指童年。潘岳《藉田赋》“被褐振裾，垂髫总发。”","束发:指青少年----一般指15岁左右，这时应该学会各种技艺。《大戴礼记·保傅》:“束发而就大学，学大艺焉，履大节焉。”","及笄:指女子15岁----语出《礼记·内则》“女子……十有五年而笄”。“笄”，谓结发而用笄贯之，表示已到出嫁的年岁。","待年:指女子成年待嫁,又称“待字”----语出《后汉书·曹皇后记》“小者待年于国”。以后称女子待嫁的年岁为“待年”。《文选·宋文皇帝元皇后哀策文》:“爰自待年，金声夙振。”","弱冠:指男子20岁----语出《礼记·曲礼上》“二十曰弱，冠”。古代男子20岁行冠礼，表示已经成年。左思《咏史》诗之一:“弱冠弄柔翰，卓荦观群书。”","而立:指30岁--------语出《论语·为政》“三十而立”。以后称三十岁为“而立”之年。《聊斋志异·长清僧》:“友人或至其乡，敬造之，见其人默然诚笃，年仅而立。”","不惑:指40岁--------语出《论语·为政》“四十而不惑”。以后用“不惑”作40岁的代称。","艾:指50岁----------语出《礼记·曲礼上》“五十曰艾”。老年头发苍白如艾。《民国通俗演义》三十七回:“……我年已及艾，还有什么不满意的事?”","花甲:指60岁----------以天干地支名号错综参互而得名。计有功《唐诗纪事》卷六十六:“(赵牧)大中 咸通中效李长吉为短歌，对酒曰:‘手挪六十花甲子，循环落落如弄珠’。”60岁还有称“耳顺”。","古稀:指70岁----------语出杜甫《曲江》诗:“酒债寻常行处有，人生七十古来稀。” 亦作“古希”。","皓首:指老年，又称“白首”-----《后汉书·吕强传》:“故太尉段颍，武勇冠世，习于边事，垂发服 戎，功成皓首。”","黄发:指长寿老人------语出《诗经》，如《诗·鲁颂·宫》“黄发台背”。老人头发由白转黄。曹植《赠白马王彪》“王其爱玉体，俱享黄发期。”陶渊明《桃花源记》:“黄发垂髫，并怡然自乐。”","鲐背:指长寿老人。----语出《诗经》，如《诗·大雅·行苇》“黄台背”，“台”与，“鲐”通用。《尔雅·释诂》:“鲐背，寿也。”老人身上生斑如鲐鱼背。","期颐:指百岁----------语出《礼记·曲礼上》“百年曰期，颐”。谓百岁老人应由后代赡养。苏拭《次韵苏拭《次韵子由三首》:“到处不妨闲卜筑，流年自可数期颐。”"],
    "url":"https://6275-buhuolinggan-9gyslra9e051f6a6-1304749657.tcb.qcloud.la/setting/t01cec52c4797fdaa8a.jpg?sign=da935e71b03765f458a77137bb28a7c5&t=1611656269"
  },
  {
    "name":"小说人物设定",
    "context":["其实设定人物是一件有趣的事，也许小说的主角就是我们的朋友，但因为故事的规则限制，他不得不变成一个与现实版不同，但又独具特色的他。又或者主角就是我们内心的影射，我们把自己代入故事中，我们在故事中遨游，我们想象着在各种情况下，我们会如何反应，最终发现一个全新的自己。小说中的人物是一个真实的，有想法的，有血肉的人，他/她生活在一个真实的世界里，哪怕这个世界可能是被虚构出来的；他/她会对身边所有的刺激做出反应，他/她会因为遭遇某些事情，而感觉到开心、兴奋、沮丧或者伤心；他/她不知道未来会如何发展，也不知道下一个出现在他们面前的人会带来什么，他们与我们几乎是一样的。唯一不同的是，他们拥有一个上帝，而我们没有。真实，是小说人物最重要的特征。我们在脑中塑造出一个真实的形象之后，就得想想该怎么改变他了。小说讲述的是一个故事，而这个故事并不是单纯的说道理，而是要通过人物的改变，从而使读者能够悟出一些道理来。即使我们是上帝，我们也无法掌控我们塑造出来的人物的命运，但命运是一种趋势，作为上帝，我们可以把握趋势。人物有弱点，有缺陷，这是必然的，否则他就不够真实，但他也会有优点，会有浓烈的情感，他在做出改变的时候，这种优点和情感会逐渐地释放出来，从而盖过他的弱点和缺陷。毕竟谁也不喜欢一个十恶不赦的人成为主角。人物得有名字和形象。名字有时也可以作为隐喻，而形象有时也可能影响人物的性格，这些看似细节的问题，有的时候会成为关键的因素，引导整个故事的发展。人物得有朋友圈，也会有对立面，这些因素的转变，有时可能意味着人物的阶段性变化，它们使得人物变得更成熟，变得更加优秀，或者生存力更强。人物得有自我意识，这样他才能够活过来，成为一个真正的人物。"],
    "url":"https://6275-buhuolinggan-9gyslra9e051f6a6-1304749657.tcb.qcloud.la/setting/df1b21cb8edfd10f8a2286a237d8c99c.jpg?sign=0f22f721cda69df07a598b179ebe8b91&t=1611656557"
  },
  {
    "name":"如何刻画人物性格",
    "context":["1、白描，也称“粗笔描写”、“速写”、“写意”，原为中国绘画传统技巧之一。指不着颜色，也不画背景，只采用墨线勾勒出人或物的形象的画法。后来，这种辉煌技巧被引入到写作中，引申为文章的表达笔法之一。运用白描法写人，其特点是：不用或少用色彩浓重的修饰性形容词，不加渲染、烘托，也不使用任何修辞手法，只是用简洁朴素的文字，抓住事物的主要特征，寥寥数语勾勒出生动、传神的形象。使用白描手法的优点是节俭、经济、节奏快，有利于情节发展，因此很符合读者的欣赏习惯。白描法如果运用成功，可以取得以少胜多的艺术效果，给人留下教为深刻的印象。","2、工笔，也称“细笔”，原是中国绘画技法用语，与“写意”对称，属于工整细致一类密体的画法。摘文章中则指用细致入微、工整细蜜的笔触，对人物进行刻画、雕琢的描写手法。在小说中常用来写景和展示人物的心理。常用对比、比喻、拟人、夸张等多种修辞手法。讲究铺陈和渲染，语言精细、富于色彩。","3、语言描写法是人物描写技巧之一，通过对人物的语言的描绘来刻画人物性格，分对话和独白两种。语言是人的思想、性格、心理活动的表现，它必须符合人物的身份、地位、经历、习惯等等，使读者听其言，见其人，知其心。不同的人物有不同的语言，同一人物在不同的时间、不同的环境中，由于情绪、性格的变化，其语言也有差异。","4、细节描写即对人物形象特征、动作、语言、心理及处所的环境和场面等那些细微而极富表现力的环节所作的特写式描写。它可以显示人物、环境、场面中的细小特征和变化，对刻画人物、显示背景组织情节、深化主题等方面都起着重要的作用。","5、对人物心理活动或思想变化，生动形象地描绘出来，是常用的人物描写之一。它可以直接展现人物的内心世界，交代人物的思想基础，行动的内在依据。心理描写可以直接由作者进行描绘，也可以由作品中的人物表白、倾吐，还可以通过描写人物外在形态，间接地显示，通过环境、景物、氛围等来进行折射。"],
    "url":"https://6275-buhuolinggan-9gyslra9e051f6a6-1304749657.tcb.qcloud.la/setting/9301655_160101881000_2.jpg?sign=d0ca2f6e053d8e46d11424f498a5d664&t=1611657611"
  }
]
module.exports={
  data:setting
}