// 单字姓氏
var singularsurname = ["赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","鬱","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","卻","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄","阙","东","欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空","曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游","竺","权","逯","盖","益","桓","公",];
// 性别
var gender = ["女","男"];
// 复姓
var complexsurname = ["万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方","赫连","皇甫","尉迟","公羊","澹台","公冶","宗政","濮阳","淳于","单于","太叔","申屠","公孙","仲孙","轩辕","令狐","钟离","宇文","长孙","慕容","鲜于","闾丘","司徒","司空","亓官","司寇","仉督","子车","颛孙","端木","巫马","公西","漆雕","乐正","壤驷","公良","拓拔","夹谷","宰父","谷粱","晋楚","闫法","汝鄢","涂钦","段干","百里","东郭","南门","呼延","归海","羊舌","微生","岳帅","缑亢","况后","有琴","梁丘","左丘","东门","西门","商牟","佘佴","伯赏","南宫"];
// 2000个常见字
var name = ["乙","乃","了","力","丁","刀","刁","二","又","人","入","七","十","几","口","干","工","弓","久","己","土","大","丈","女","巾","勺","也","于","弋","巳","三","下","上","乞","士","夕","千","子","寸","小","山","川","才","凡","孔","中","之","丹","井","介","今","及","太","天","斤","丑","支","允","元","勿","午","友","尤","尹","引","文","月","日","牙","王","云","匀","四","仁","什","切","升","收","壬","少","心","氏","水","仍","双","尺","仇","止","不","互","分","匹","化","卡","卞","反","夫","巴","幻","户","方","木","比","毛","丰","火","片","古","可","甘","刊","五","丘","加","去","句","叫","外","巧","玉","甲","令","占","主","冬","代","只","仗","另","召","尼","正","田","旦","奴","立","仝","伏","台","央","右","未","永","以","戊","瓦","由","幼","仕","仙","司","且","史","左","世","出","市","玄","仔","冉","穴","示","生","仟","册","求","石","匝","甩","丙","平","母","末","包","本","弗","北","必","丕","半","布","目","乏","禾","皮","乎","付","卉","民","冰","白","卯","伉","光","匡","共","各","考","交","件","价","企","伍","伎","仰","吉","曲","机","六","仲","州","朱","兆","决","匠","地","旨","吏","列","年","劣","同","打","汀","灯","竹","老","舟","圳","的","宅","虫","伊","印","因","宇","安","而","耳","衣","亦","吃","夷","聿","休","任","先","全","再","冲","刑","向","在","夙","如","守","字","存","寺","式","戌","早","旭","旬","次","此","系","自","舌","血","行","西","尖","色","后","名","回","好","帆","灰","牟","百","份","米","伐","亥","合","朴","汜","复","告","改","攻","更","杆","谷","况","伽","估","君","吴","吾","圻","均","坎","研","完","局","岐","扣","杞","江","究","见","角","言","住","低","佃","里","冷","伶","利","助","吝","昌","壮","妓","弄","彤","托","杖","杜","呆","李","良","具","皂","佟","体","足","甸","町","豆","吞","玎","位","佐","佘","冶","吟","吻","尾","巫","役","忘","我","修","邑","酉","伸","作","些","初","吹","呈","坐","宋","希","岑","序","巡","形","忍","成","杏","材","杉","束","村","步","汝","汐","池","私","赤","身","车","辰","伺","余","劭","邵","妆","汕","灶","即","却","何","伯","伴","佛","兵","判","别","含","坊","坂","旱","每","甫","牡","免","孚","庇","忙","汛","贝","供","侃","刻","卦","固","坤","姑","官","冈","庚","快","抗","昆","空","其","券","卷","奇","委","季","宜","居","届","岢","岸","佳","京","侄","来","例","制","兔","两","典","周","坦","奈","宙","定","屉","帖","底","店","征","忝","念","技","投","政","枝","东","林","汰","玖","知","直","纠","金","佰","侗","佻","冽","拈","岭","帙","抒","杼","沓","竺","长","侑","夜","宛","岳","岩","往","亚","於","易","昂","旺","沅","沃","汪","物","艾","卧","佯","咏","抑","昀","炎","杳","享","侍","使","侈","然","刹","刺","协","卒","洽","沁","取","受","垂","始","炊","尚","屈","弦","所","承","昔","松","沙","沈","社","舍","采","青","幸","徇","争","刷","效","炙","宗","岫","析","枕","状","八","并","佩","函","和","命","坡","坪","奉","孟","帛","府","彼","忽","或","房","扮","枇","扶","放","昏","朋","服","明","杭","杯","枚","板","沛","沐","汾","版","牧","虎","门","阜","杷","盲","非","冠","皈","客","故","柑","柯","科","革","屋","癸","砍","禹","轨","页","九","亭","柱","俊","侣","冒","段","劲","南","姬","姜","姣","帝","度","待","律","怠","急","招","拒","拓","拙","拉","昭","架","柳","注","治","炭","界","皆","突","纪","纣","耐","致","计","订","军","俐","厘","咨","姝","姿","重","珏","俄","俞","勇","威","娃","姻","姚","姨","幽","彦","奕","玟","怡","押","映","昱","韦","泳","沿","烟","盈","约","衍","要","音","柚","信","俗","促","俏","前","则","奏","型","姹","室","宣","巷","哉","思","性","施","星","查","栅","染","泉","甚","相","省","砂","祈","秋","穿","肖","首","贞","便","勉","品","封","哈","皇","拔","抱","怕","柏","柄","泌","法","炳","盆","虹","秒","表","负","面","风","飞","勃","厚","咸","叛","孩","奂","屏","河","泛","赴","库","拱","格","桂","肯","贡","高","个","刚","宫","径","挂","皋","徒","倜","恬","指","料","旅","晋","桔","桃","桐","洞","流","洛","酒","特","真","矩","祝","秩","租","站","级","纸","纳","纽","者","肩","记","讨","酌","针","钉","借","倒","值","俱","倪","倘","伦","兼","唐","哲","凌","洲","套","爹","留","俩","庭","恫","栗","株","津","玳","畜","砧","恩","按","案","洋","秧","翁","纹","耘","育","蚊","袁","倚","原","员","埃","宴","峨","娱","容","峪","晏","移","益","师","席","座","徐","恰","息","恕","持","拳","拾","时","书","曹","校","朔","桑","栽","殊","气","珊","祠","祖","秦","秤","索","素","纱","纾","纯","虔","讫","训","财","起","轩","芩","闪","迅","倩","仓","城","夏","孙","峡","奚","乘","淞","宵","拭","牲","洵","兹","宸","旁","晃","桓","洪","畔","亩","眠","破","炮","秘","粉","纺","航","般","配","马","倍","俯","俸","们","圃","埋","涵","埔","害","恢","恍","恒","派","洹","玻","珉","祜","国","寇","康","袍","规","贯","够","勘","崞","岗","梗","偕","停","侦","剪","动","翎","堆","寄","专","张","教","条","梁","梯","械","梨","浙","浪","皎","眷","窕","竟","终","累","舵","苓","诀","近","钓","顶","将","那","庶","振","挺","捉","祭","趾","囵","崃","带","帐","徕","悌","画","梃","娄","伟","偶","务","唯","问","悠","悦","敖","晚","梧","浴","眼","苑","英","迎","鱼","浣","翌","圉","乾","做","区","卿","参","售","启","商","唱","娶","妇","宿","崇","崎","崔","常","强","从","悄","叙","旋","晨","晟","族","消","爽","犀","祥","绅","细","紫","组","绍","羞","习","邢","舷","船","茄","若","处","术","袖","设","讼","责","赦","雀","雪","顷","彩","圊","执","峥","悉","笙","钏","阡","凰","培","密","彬","曼","海","班","瓶","毕","盒","符","范","茅","苗","觅","访","货","返","贩","闭","麦","麻","壶","票","副","捕","敏","皓","梅","第","珩","苹","贵","辜","开","询","植","堵","岚","帧","捷","掏","掎","推","探","接","敦","景","智","晶","替","朝","椒","棠","栈","淘","添","淡","净","焦","街","理","荔","眨","贴","间","单","传","塘","塔","暖","楠","殿","渡","汤","惟","涯","砚","围","越","阮","轶","雁","雅","寓","喻","琰","寒","偏","惠","扉","排","普","棉","淼","淮","番","脉","茗","邯","闵","感","莞","涂","谦","斟","极","绢","经","茎","获","莅","庄","蜀","解","詹","鼎","路","迹","铃","桢","农","湍","当","励","园","圆","意","扬","榆","业","杨","椰","涌","渝","游","炜","犹","筠","莠","虞","蛾","裕","诣","郁","钰","预","饮","莹","筵","新","喧","楸","楚","岁","湘","煦","琴","琪","琦","祺","绣","群","圣","诩","诗","试","诠","详","资","熙","暄","琼","想","椿","渚","琛","幕","汇","惶","挥","描","换","楣","枫","湖","浑","渺","涣","煤","琶","琥","盟","睦","碑","禀","聘","腑","荷","莫","号","蜂","补","话","附","颁","饭","晕","募","焕","廓","愧","沟","管","纲","诰","魁","构","歌","恺","荣","通","连","甄","兢","喜","团","图","奖","嫡","僚","侥","崭","祯","端","箕","筝","精","绿","绫","纶","置","璋","畅","尔","莱","赵","铬","领","瑙","闻","嫣","愿","温","源","溢","瑜","瑛","瑗","玮","与","舞","诱","语","郢","银","摇","榕","溶","菸","菀","僖","逑","速","逍","寿","尘","嫩","实","侨","慈","滋","沧","溪","瑞","瑟","算","粹","绸","综","绮","菁","裳","誓","诵","说","诚","轻","菘","衔","限","韶","饰","旗","齐","熏","尝","慎","溯","梦","瑚","珲","碧","福","绵","翡","华","菩","蜜","裴","宾","辅","郝","铭","阀","陌","颇","凤","鸣","槐","广","慷","惯","概","瑰","葛","葵","课","郭","稿","锆","俭","著","厉","剧","剑","刘","妖","履","帜","徵","德","虑","摘","敌","暂","闾","乐","楼","樟","滴","渐","涨","浆","练","缔","蒂","骀","落","董","葶","蝶","调","谈","诋","诤","谅","论","质","驼","践","轮","进","铝","阵","驾","驻","稽","稻","节","黎","侬","幢","嶙","锻","褚","亿","仪","影","慰","忧","样","欧","演","渔","熠","熨","瑶","缘","纬","万","叶","苇","谊","逸","邮","阅","院","颐","颍","缓","妩","鉴","署","增","审","层","厂","厮","庆","数","熟","萱","贤","赏","赐","漩","箴","绪","翦","划","哗","坟","墨","慧","慕","慢","暮","樊","标","模","汉","满","漫","漂","玛","编","铺","葆","葡","赋","部","盘","码","篇","麾","劈","幡","摩","褒","器","横","橄","篙","馆","尽","坛","惮","历","瞳","橘","洁","潭","瑾","庐","积","筑","蒸","诸","诺","赖","蹄","辑","道","都","录","锦","陆","陶","陵","霓","霖","静","颊","头","赚","橙","润","澈","笃","萤","谙","谕","逾","运","儒","学","宪","熹","憧","晓","桥","樵","橡","树","潮","莳","璇","聪","融","亲","谌","谐","遂","醒","错","陈","蓄","苍","侪","澍","莼","铮","锡","奋","抚","蒙","衡","讳","讽","辨","锚","陪","默","蒲","蓓","滨","凭","颖","恳","阶","瞰","懂","据","捡","浓","烛","璐","磷","绩","联","胶","膛","临","举","莲","蔗","蒋","讲","递","钟","泽","沣","潞","澄","优","婴","屿","应","忆","拥","澳","营","蔚","荫","舆","锾","闱","阳","偿","擅","禧","穗","簇","纵","总","声","襄","邹","乡","隋","霜","鲜","戏","弥","篷","缝","繁","韩","柜","圹","归","蒉","拟","抬","挤","爵","礼","简","粮","职","旧","蕉","谨","转","遮","题","镇","储","藜","芷","迟","鲤","翼","医","隘","瑷","丛","曙","织","萧","适","锁","垒","断","柠","泞","槟","环","蕃","庞","璧","馥","扩","关","铿","祷","荐","勒","襟","谭","证","轿","辽","邻","郑","邓","鲸","麓","镜","觉","际","栎","泺","链","韵","稳","薏","遗","雾","艳","韫","玺","薛","薪","识","赞","迁","选","簿","绘","瀑","宝","祢","薜","谱","矿","阚","岿","藉","蓝","筹","竞","译","议","邀","懿","萨","藏","薰","壤","悬","曦","脐","馨","释","献","孀","籍","谵","锈","怀","瀚","缤","迈","飘","膑","朦","顾","钚","俪","栏","镯","藤","览","铛","斓","藕","跃","迩","莺","续","随","属","攘","茑","藩","辩","鹤","听","芦","读","铸","籁","滩"];
var girlname = ["妃","霞","蔓","樱","艺","恋","薇","兰","丽","嫔","蕊","蝉","黛","蓉","婵","娴","萍","翠","莎","琳","爱","媚","莉","雯","媛","婷","茵","琬","婉","珠","甜","婧","芳","芙","花","芽","芸","玲","珍","娟","芝","娜","柔","春","香","眉","红","美","玫","欣","姐","姒","姗","妲","妯","依","果","妮","儿","秀","朵"];
var boyname = ["卓","臣","男","廷","弟","志","努","丞","择","克","巨","申","充","仞","亮","宦","奎","建","峙","畏","胤","柴","侠","狩","宰","射","挈","狱","骆","俦","擘","键","涛","鸿","壕","戴","誉","遵","霸","铁","鹏","笞","篮","荩","严","瀛","耀","拢","警","枥","槠","攀","沥","泷","罗","露","腾","党","濑","窦","彝","潍","磬","隆","燧","骏","豫","钱","赛","潘","磨","阊","桦","壁","达","陲","赢","勋","漠","雕","战","撰","缙","磐","阴","暨","谛","疆","臻","钢","龟","沪","锋","枢","漆","霄","驷","磁","箭","浒","辉","罚","辍","醉","锐","卫","葳","熬","兴","摧","鞍","稷","啸","鲁","谆","墩","震","霆","毅","榜","醇","豪","宽","造","逵","寨","逢","岖","绰","鞅","硕","榔","滇","彰","廖","监","熊","轼","颂","驰","粲","裔","催","勤","势","嗣","嵩","厦","奥","雍","肄","煜","义","衙","雷","靖","傅","楷","港","琨","廊","敬","鼓","贾","贺","贸","费","帏","富","迢","迪","迦","量","钧","冕","帮","弼","彭","徨","掘","轸","彪","邦","胡","舶","渊","焰","焱","博","凯","浩","烽","斌","寅","野","庸","尉","帷","朗","健","坚","堂","峰","烈","展","峻","准","泓","侯","保","奔","俟","恭","耕","耿","帅","武","忠","杰","宏","孝","屹","艮","圭","弘","屯","斗","牛","勾","公","亢","丸"];
// 外貌
var appearance = ["浓眉大眼","慈眉善目","气宇轩昂","高大魁梧","英姿飒爽","衣着得体","一表人才","风度翩翩","衣冠楚楚","青面獠牙","貌比潘安","秀色可餐","膀大腰园","披头散发","相貌堂堂","闭月羞花","沉鱼落雁","大腹便便","虎背熊腰","尖嘴猴腮","贼眉鼠眼","眉清目秀","容光焕发","美如冠玉","出水芙蓉","冰肌玉骨","冰清玉洁","明眸皓齿","道貌岸然","国色天香","粉白黛黑","傅粉施朱","婀娜多姿","亭亭玉立","鹤发童颜","鹤发鸡皮","短小精悍","面黄肌瘦","面如土色","面红耳赤","面有菜色","蓬头垢面","囚首垢面","蓬头历齿","鸠形鹄面","铜筋铁骨","肠肥脑满","骨瘦如柴","披头散发","虎头虎脑","白净柔嫩","满面红光","满头银发","目光炯炯","双目如潭","火眼金睛","肥头大耳","白发苍苍","楚楚动人","玉树临风","花容月貌","仪表堂堂","披头散发","老态龙钟","如花似玉","眉清目秀","容光焕发","美如冠玉","出水芙蓉","道貌岸然","雾鬓风鬃","短小精厚","面黄肌瘦","大腹便便","仪表堂堂","玉树临风"];
// 职业
var occupation = ["教师","工人","记者","演员","厨师","医生","护士","司机","军人","律师","商人","会计","店员","出纳","作者","导游","模特","警察","歌手","画家","裁缝","翻译","法官","保安","服务员","清洁工","建筑师","理发师","采购员","设计师","消防员","机修工","推销员","魔术师","模特儿","邮递员","售货员","救生员","运动员","工程师","飞行员","管理员","机械师","经纪人","审计员","漫画家","园艺师","科学家","主持人","调酒师","化妆师","音乐老师","艺术家","糕点师","甜品师","运动员","外交官","弹钢琴","古筝手","设计师","赛车手","理发师","程序员","CEO"];
var ancientoccupation = ["帝王","圣贤","隐士","文人","武士","阁老","宰相","农民","工人","商人","大夫","向命","丹青","书生","琴棋","僧人","师爷","衙差","媒婆","剃头","裁缝","吹手","大神","风水","渔夫","小二","马夫","绣娘","镖师","官奴","私塾","道士","厨子","太监","粮商","使节","丫鬟","绣工","游侠","屠夫","舞女","乐人","太师","太傅","太保","少师","少傅","少保","太宰","少宰","六卿","丞相","宰相","御史","太尉","九卿","太仆","廷尉","宗正","少府","将军","冼马","大夫","博士","郎中","侍郎","中郎","议郎","令史","尚书","六曹","合阁","仆射","侍中","内史","刺史","州牧","别驾","知府","亲王","总督","巡抚","监司","州判","知县","提督","总兵","参将"];
var fantasyoccupation = ["符师","战士","牧师","祭司","巫师","战士","武士","法师","祭祀","炼丹师","炼器师","魔法师","元素师","龙骑士","言灵师","天命者","瞳术师","预言师","占星师","音魂师","召唤师","阵法师","驯兽师","阵法师","治疗师","魔导师"];
var futureoccupation = ["药剂师","机械师","机甲师","医疗师","运动员","经纪人","漫画家","科学家","主持人","程序员","教师","学生","记者","演员","厨师","律师","商人","模特","警察","歌手","画家"];
// 爱好
var hobby = ["摄影","练瑜伽","酿酒","喝普洱茶","角色扮演","上美术课","学习一件乐器","养花","和朋友打牌","写博客","做剪贴簿","徒步旅行","品酒","做果酱","做首饰","做志愿者","下棋","集邮","书法","养鸟","养猫","去野营","钓鱼","热衷于关注和讨论新闻","学习魔术","攀岩","越野跑","游泳","舞蹈","做饭","打保龄球","收藏古董","做木工","击剑","去孤儿院","投资","写日记","折纸","桌游","看电视","写小说","去冲浪","染布","玩拼字游戏","射箭","踢足球","划船","滑雪","滑冰","跑酷","拳击","放风筝","玩飞镖","骑马"];
// 家庭状况
var familystatus = ["双亲家庭","单亲家庭","孤儿","家庭美满","多子女家庭","独生子女家庭","不和睦家庭","和睦家庭"];
// 立场
var position = ["中立","正面立场","反面立场","立场不明"];
// 出身
var birth = ["农村家庭","城市家庭","知识分子家庭","工人家庭","军人家庭","同性恋家庭","农民家庭","富二代","富裕家庭","贫困家庭","富可敌国","红三代"];
var ancientbirth = ["神秘家族","王子皇孙","农村家庭","城镇家庭","知识分子家庭","军人家庭","农民家庭","富裕家庭","贫困家庭","富可敌国","权贵家庭","皇亲国戚","富商子女","勋贵家庭"];
// 性格
var character = ["乐天达观","成熟稳重","幼稚调皮","温柔体贴","活泼可爱","普普通通","内向害羞","外向开朗","心地善良","聪明伶俐","善解人意","风趣幽默","思想开放","积极进取","小心谨慎","郁郁寡欢","正义正直","悲观失意","好吃懒做","处事洒脱","疑神疑鬼","患得患失","异想天开","多愁善感","淡泊名利","见利忘义","瞻前顾后","循规蹈矩","热心助人","快言快语","少言寡语","爱管闲事","追求刺激","豪放不羁","狡猾多变","贪小便宜","见异思迁","情绪多变","水性扬花","重色轻友","胆小怕事","积极负责","勇敢正义","聪明好学","实事求是","务实实际","老实巴交","圆滑老练","脾气暴躁","慢条斯理","诚实坦白","婆婆妈妈","朴素","憨厚","大方","诚实","忠诚","诚恳","谦虚","虚心","果断","天真","幼稚","活泼","聪明","圆滑","狡猾","虚伪","自私","任性","骄傲","贪婪","愚蠢","奸诈"];
// 身体状况
var healthstatus = ["状况良好","残疾","身体健康","心脏病","哮喘","高血压","低血压","高血糖","低血糖","胃炎","耳聋","眼盲","胃溃疡","偏头痛"];
// 发型
// 现代/科幻女性
var ghairstyle = ["丸子头","蜈蚣辫","公主切","丸子头","三股辫","双马尾","波浪卷","大波浪","蘑菇头","齐刘海","波波头","梨花头","蛋卷发","羊毛卷","花苞卷","空气卷","胎毛卷","马尾","长发","短发","中分","侧分","八字刘海","中分齐肩直发","中长卷发","法式刘海"];
// 现代/科幻男性
var bhairstyle = ["板寸","毛寸","圆寸","碎发","背头","卷发","朋克","纹理烫","中长发","长发","韩式烫发","飞机头","锡纸烫","锅盖头","油头","皮卡路发型","侧分背头"];
// 古代/玄幻女性
var ancientghair = ["巾帼","双螺","倾髻","凤冠","旗头","花冠","飞天髻","双丫髻","垂桂髻","百合髻","灵蛇髻","两把头","抛家髻","架子头","双刀髻","倭赘髻","元宝髻","惊鸿髻","十字髻","高椎髻","飞仙髻","牡丹头","双平髻","凌云髻","莲花冠","堕马髻","朝云近香髻"];
// 古代/玄幻男性
var ancientbhair = ["立体感扎发","飘逸露额扎发","高发髻盘发","碎发高扎发","高发辫","龙须刘海半扎发","个性编发","脏辫编发","发簪盘发"];
// 眉毛
var geyebrow = ["秋娘眉","水弯眉","嫦娥眉","新月眉","羽玉眉","一字眉","黛玉眉","双燕眉","小山眉","柳叶眉"];
var beyebrow = ["一字眉","自然眉","新月眉","三角眉","卧蚕眉","螺旋眉","疏散眉","尖刀眉","罗汉眉","狮子眉","扫帚眉","间断眉","八字眉","竖眉","倒眉","剑眉","龙眉"];
// 眼睛
var geye = ["杏仁眼","丹凤眼","桃花眼","三角眼","肿泡眼","深窝眼","近心眼","远心眼","葡萄眼","下垂眼","柳叶眼","圆眼","大小眼"];
var beye = ["标准眼","荔枝眼","丹凤眼","三白眼","眯缝眼","三角眼","近心眼","远心眼","深窝眼","下垂眼","肿泡眼","细长眼","桃花眼"];
// 鼻子
var gnose = ["蒜头鼻","朝天鼻","小翘鼻","希腊鼻","水滴鼻","塌梁鼻","罗马鼻","犹太鼻","拉美人鼻"];
var bnose = ["希腊鼻","塌梁鼻","鹰嘴鼻","眉心鼻","胡羊鼻","猛虎鼻","悬胆鼻","狮子鼻","罗马鼻","犹太鼻","拉美人鼻"];
// 嘴
var gmouth = ["微笑唇","嘟嘟唇","椭圆型","外翻型","樱桃唇","厚嘴唇","爱心唇","覆舟唇","薄嘴唇","含珠唇","M唇"];
var bmouth = ["微笑唇","椭圆型","外翻型","厚嘴唇","爱心唇","覆舟唇","薄嘴唇","含珠唇","M唇"];
// 饰品
var ornaments = ["戒指","扳指","项链","脚链","胸针","耳钉","耳环","手链","手镯","袖扣","手表","眼镜","发夹"];
var gancientornaments = ["簪子","步摇","珠钗","梳篦","抹额","旗头","点翠","扁方","华胜","花钿","玉珏","项圈","璎珞","胸针","玉佩","手镯","戒指","指甲套"];
var bancientornaments = ["玉冠","玉佩","扳指","带钩","宝剑","簪花","抹额","扇子","香囊"];
// 气质
var gtemperament = ["吝啬","贪婪","贪心","自私","虚伪","獐头鼠目","鼠目寸光","贼眉鼠眼","胡搅蛮缠","不可理喻","丢三落四","心胸狭隘","朝三暮四","狗仗人势","脑满肠肥","红颜知己","红粉佳人","小家碧玉","小鸟依人","貌似天仙","仙女下凡","花容月貌","如花似玉","柳腰花态","窈窕淑女","左家娇女","宛转蛾眉","蛾眉皓齿","曲眉丰颊","朱唇皓齿","杏脸桃腮","细肌嫩肤","香艳脱俗","兰质蕙心","明眸皓齿","绝代佳人","秀色可餐","秀外慧中","温香艳玉","倾国倾城","国色天香","姹紫嫣红","绝世惊艳","琪花瑶草","螓首蛾眉","冰肌玉骨","仙姿玉色","花颜月貌","玉洁冰清","冰雪聪明","明艳动人","花枝招展","柳娇花媚","柳弱花娇","妍姿艳质","艳色绝世","亭亭玉立","花信年华","我见犹怜","远山芙蓉","章台杨柳","姿色诱人","美艳绝伦","楚楚可人","楚楚动人","美丽动人","惊鸿绝艳","柳夭艳影","浓桃艳李","温香艳玉","玉质天成","丰姿妍丽","天生丽质","仙姿玉貌","沉鱼落雁","闭月羞花","人间尤物","白璧无瑕","二八佳人","艳压群芳","艳惊四座","出水芙蓉"];
var btemperament = ["吝啬","贪婪","贪心","自私","虚伪","獐头鼠目","鼠目寸光","贼眉鼠眼","胡搅蛮缠","不可理喻","丢三落四","心胸狭隘","朝三暮四","狗仗人势","脑满肠肥","浪蝶狂蜂","浪蝶游蜂","怜香借玉","面如傅粉","玉树临风","鹤立鸡群","一表人才","英勇好斗","武艺高强","见义勇为","美如冠玉","面如冠玉","品貌非凡","才貌双绝","惊才风逸","风流才子","气宇轩昂","玉树临风","英姿飒爽","风流倜傥","英俊潇洒","英姿勃勃","英姿焕发","足智多谋","温文尔雅","面冷心慈","一团和气","貌似潘安","眉清目朗","一表人才","威风凛凛","落落大方","眉清目秀","相貌堂堂","风度翩翩","衣冠楚楚","城北徐公","明眸皓齿","掷果潘安","浓眉大眼","玉质金相","神采奕奕","英俊潇洒","气宇轩昂","风度翩翩","古雕刻画","俊美无涛","淡定优雅","飘逸宁人","探扇浅笑","玉树临风","气宇不凡","血气方刚","体贴入微"];
// 身材
var gfigure = ["苹果型","H型","梨形","圆形","沙漏型","瘦小型","超高型","标准型"];
var bfigure = ["梯形","倒三角体型","H型","正三角体型","O型"];
var place = ["大学","中学","小学","幼儿园","有限公司","庄","县","村","山","海","市","省","区","路"];
var ancientplace = ["庄","府","村","洲","堡","乡","县","镇","郡","坡","城","港","山","海"];
var fantasyplace = ["庄","府","村","观","堡","县","宗","纺","郡","谷","岛","峰","洞","崖","山","海"];
var futureplace = ["星","学校","联盟","联邦","大学","中学","小学","幼儿园","山","海","有限公司","区","路"];
var gcloth = ["运动衣","西装","校服","jk制服","洛丽塔","礼服","汉服","休闲装","衬衫A字裙","T恤百褶裙","羽绒服","衬衫牛仔裤","卫衣牛仔裤","民族服饰","嘻哈","简约服饰","通勤","棉衣"];
var bcloth = ["运动衣","西装","汉服","休闲装","校服","dk制服","民族服饰","毛衣牛仔裤","嘻哈","简约服饰","羽绒服","针织杉牛仔裤","T恤运动裤","冲锋衣运动裤","衬衫牛仔裤","皮衣皮裤","卫衣牛仔裤"];
var gancientcloth = ["碎花翠纱露水百合裙","霞彩千色梅花娇纱裙","古纹双蝶云形千水裙","牡丹凤凰纹浣花锦衫","金丝白纹昙花雨丝锦裙","曳地水袖百褶凤尾裙","漩涡纹纱绣裙","软银轻罗百合裙","蝶戏水仙裙衫","镂金百蝶穿花云锦袄","四喜如意云纹锦锻","烟云蝴蝶裙","暗花细丝褶缎裙","镂金丝钮牡丹花纹蜀锦衣","碧霞云纹联珠对孔雀纹锦衣","对襟羽纱衣裳","宫缎素雪绢裙","缕金百蝶穿花云缎裙","刺绣妆花裙","素绒绣花袄","紫绡翠纹裙","藕丝琵琶衿上裳","云纹绉纱袍","百花曳地裙","撒花烟罗衫","银纹绣百蝶度花裙","缕金挑线纱裙","梅花纹纱袍","娟纱金丝绣花长裙","百褶如意月裙","翠纹织锦羽缎斗篷"];
var bancientcloth = ["红色交领大袖长袍","纯白团花丝绸圆领长袍","团花宽袖交领曲裾袍","白色无袖交领曲裾深衣","圆领宽袖白纱褙子","宝圆镜柳叶细甲","锦绣盘龙梨花袍","衬甲白罗袍","金银丝鸾朝凤修纹朝服","弹花暗纹锦服","写意花纹的浅米色圆领长衫"];

var shoes = ["运动鞋","皮鞋","球鞋","板鞋","马丁鞋","靴子","凉鞋","豆豆鞋"];
var gancientshoes = ["百合草履子","五朵草履子","棉鞋","旗鞋","金薄重台履","透空锦靿靴","重台履","高墙履","云丝绣鞋","软底珍珠绣鞋","乳烟缎攒珠绣鞋","宝相花纹云头锦鞋","云烟如意水漾红凤翼缎鞋","双色缎孔雀线珠芙蓉软底鞋"];
var bancientshoes = ["黑缎靴","屦","屐","尖翘头方履","高丽式靴","云头履","短筒靴","方头朝靴"];


module.exports={
  gcloth:gcloth,
  bcloth:bcloth,
  gancientcloth:gancientcloth,
  bancientcloth:bancientcloth,
  shoes:shoes,
  gancientshoes:gancientshoes,
  bancientshoes:bancientshoes,
  place:place,
  ancientplace:ancientplace,
  fantasyplace:fantasyplace,
  futureplace:futureplace,
  bhairstyle:bhairstyle,
  ancientghair:ancientghair,
  ancientbhair:ancientbhair,
  geyebrow:geyebrow,
  beyebrow:beyebrow,
  geye:geye,
  beye:beye,
  gnose:gnose,
  singularsurname:singularsurname,
  complexsurname:complexsurname,
  name:name,
  appearance:appearance,
  occupation:occupation,
  ancientoccupation:ancientoccupation,
  fantasyoccupation:fantasyoccupation,
  futureoccupation:futureoccupation,
  hobby:hobby,
  familystatus:familystatus,
  position:position,
  birth:birth,
  ancientbirth:ancientbirth,
  character:character,
  healthstatus:healthstatus,
  ghairstyle:ghairstyle,
  bfigure:bfigure,
  gfigure:gfigure,
  btemperament:btemperament,
  gtemperament:gtemperament,
  bancientornaments:bancientornaments,
  gancientornaments:gancientornaments,
  ornaments:ornaments,
  bmouth:bmouth,
  gmouth:gmouth,
  bnose:bnose,
  gender:gender,
  girlname:girlname,
  boyname:boyname
}